# СРО №2  
## Калькулятор выражений со стеком

ФИО: Зураб Хунчиев  

---

Введение  
В данной работе изучена структура данных стек и принцип LIFO.  
Реализована программа для вычисления выражений.

---

Цель работы  
Изучить стек и применить его для вычисления выражений.

---

Задачи  
- реализовать стек  
- разобрать выражение  
- вычислить результат  

---

Описание программы  
Программа написана на Java.  
Используются два стека: числа и операции.  

Пример:  
3+5*2  

Результат:  
13.0  

---

Используемые технологии  
Java  
Visual Studio Code  

---

Заключение  
Стек помогает правильно учитывать порядок операций.
